[
  {
    "id": 0,
    "sectionName": "Механіка",
    "routeName": "mechanics",
    "img": "https://cdn.pixabay.com/photo/2016/06/12/20/26/macro-1452986_1280.jpg",
    "img_alt": "mechanics",
    "themes": [
      {
        "themeName": "Основи кінематики",
        "themeRoute": "fundamentalsKinematics",
        "info": [
          {
            "text": "Механічний рух – це зміна положення тіла у просторі з часом.",
            "formulas": []
          },
          {
            "text": "Під системою відліку розуміють сукупність тіла відліку, відносно якого фіксується зміна положення інших тіл, систему координат, яка позволяє числами виражати положення тіл і годинник для вимірювання часу. Обов’язковим елементом системи координат є одиниця довжини, яка дозволяє відраховувати відстані. В міжнародній системі СІ одиниця довжини – метр (1 м), а одиниця часу – секунда (1 с).",
            "formulas": []
          },
          {
            "text": "Стан спокою і руху тіл є відносним і залежить від обраної системи відліку. (Людина в кріслі рухомого поїзду знаходиться в стані спокою відносно поїзду і рухається відносно Землі).",
            "formulas": []
          },
          {
            "text": "Матеріальна точка – це умовне тіло, яке не має розмірів і визначає положення реального тіла в просторі координатами цієї точки.",
            "formulas": []
          },
          {
            "text": "Траєкторія руху тіла – уявна лінія, в кожній точці якої послідовно побувало тіло під час свого руху.",
            "formulas": []
          },
          {
            "text": "Шлях – скалярна величина, рівна довжині кривої, що задає траєкторію руху тіла. Шлях вимірюють в метрах.",
            "formulas": []
          },
          {
            "text": "Переміщення – векторна величина, що представляється напрямленим відрізком, який з’єднує початкову і кінцеву точки руху тіла. (Порівняйте – переміщення точки, що здійснила повний оберт по колу рівне нулю, а пройдений шлях 2πR, де R – радіус кола). Переміщення вимірюють в метрах.",
            "formulas": []
          },
          {
            "text": "Швидкість тіла (величина векторна) визначає здійснене ним переміщення за одиницю часу: ___ , (розмірність м/c), де ___ – переміщення за проміжок часу ___.",
            "formulas": [
              "\\vec{v} = \\frac{\\Delta \\vec{r}}{\\Delta t}",
              "\\Delta \\vec{r} = \\vec{r}_2 - \\vec{r}_1",
              "\\Delta t = t_2 - t_1"
            ]
          },
          {
            "text": "Додавання швидкостей ___ (швидкість людини відносно Землі складається із швидкості людини відносно поїзда і швидкості поїзда відносно Землі).",
            "formulas": [
              "\\vec{v}_{л|з} = \\vec{v}_{л|п} + \\vec{v}_{п|з}"
            ]
          },
          {
            "text": "Нерівномірний рух – рух при якому тіло за рівні проміжки часу проходить різні відстані (шлях).",
            "formulas": []
          },
          {
            "text": "Середня швидкість при нерівномірному русі – величина скалярна: 𝑣 = 𝑠/t , де s- шлях, який пройшло тіло за час t.",
            "formulas": []
          },
          {
            "text": "Миттєва швидкість – величина векторна, дана для кожного моменту часу і визначається радіус-векторами положення тіла в моменти часу t і передуючий йому близький час t-Δt. ___",
            "formulas": [
              "\\begin{equation} \\vec{v}(t) = \\frac{\\vec{r}(t) - \\vec{r}(t - \\Delta t)}{\\Delta t} = \\frac{\\Delta \\vec{r}}{\\Delta t} \\end{equation}"
            ]
          },
          {
            "text": "Рівномірний рух – рух при якому величина швидкості тіла незмінна (v(𝑡) = 𝑐𝑜𝑛𝑠𝑡).",
            "formulas": []
          },
          {
            "text": "Прискорення (вектор): 𝑎⃗ = ∆ 𝑣⃗⃗/∆ 𝑡 ; розмірність - ___",
            "formulas": [
              "\\text{м}/\\text{с}^2"
            ]
          },
          {
            "text": "Рівноприскорений рух – при якому напрям і величина прискорення руху незмінні (a(𝑡) = 𝑐𝑜𝑛𝑠𝑡).",
            "formulas": []
          },
          {
            "text": "Рівняння рівномірного прямолінійного руху: ___",
            "formulas": [
              "\\begin{align} a_x(t) &= 0 \\\\ v_x(t) &= v_{0x} = const \\\\ x(t) &= x_0 + v_{0x} \\cdot t \\end{align}"
            ]
          },
          {
            "text": "Рівняння рівноприскореного прямолінійного руху: ___",
            "formulas": [
              "\\begin{align} a_x(t) &= a_{0x} = const \\\\ v_x(t) &= v_{0x} + a_{0x} \\cdot t \\\\ x(t) &= x_0 + v_{0x}t + \\frac{a_{0x} \\cdot t^2}{2} \\end{align}"
            ]
          },
          {
            "text": "Рівномірний рух по колу – обертання по колу радіусу R із сталою за величиною швидкістю. Руху по колу властива періодичність, яка характеризується періодом і частотою",
            "formulas": []
          },
          {
            "text": "Період обертання – це час T, протягом якого тіло робить один повний оберт по колу (розмірність с).",
            "formulas": []
          },
          {
            "text": "Частота обертання ν вказує кількість обертів тіла за одиницю часу (розмірність ___≡Гц). Період і частота зв’язані співвідношенням 𝜈 = 1/𝑇;",
            "formulas": [
              "c^{-1}\n"
            ]
          },
          {
            "text": "Лінійна швидкість виражається відношенням довжини кола до періоду ___.",
            "formulas": [
              "v = \\frac{2\\pi R}{T}"
            ]
          },
          {
            "text": "Кутова швидкість 𝜔 = ∆𝜑 / ∆𝑡 , де Δφ – кут, який замітає тіло за час Δt; розмірність кутової швидкості рад./𝑐 = ___.",
            "formulas": [
              "c^{-1}\n"
            ]
          },
          {
            "text": "Зв'язок частоти і кутової швидкості 𝜔 = 2𝜋𝜈.",
            "formulas": []
          },
          {
            "text": "Зв'язок лінійної і кутової швидкостей 𝑣 = 𝜔𝑅, де R- радіус кола, по якому рухається тіло.",
            "formulas": []
          },
          {
            "text": "Рівняння рівномірного руху по колу 𝜑(𝑡) = 𝜔𝑡.",
            "formulas": []
          },
          {
            "text": "При рівномірному русі по колу величина лінійної швидкості не міняється, але міняється напрям швидкості. Це викликає прискорення, яке називають доцентровим прискоренням ___. Доцентрове прискорення векторна величина (має напрям від тіла до центру кола).",
            "formulas": [
              "a = \\frac{v^2}{R} = \\omega^2 \\cdot R"
            ]
          }
        ]
      },
      {
        "themeName": "Основи динаміки",
        "themeRoute": "fundamentalsDynamics",
        "info": [
          {
            "text": "Перший закон Ньютона – якщо на тіло не діють сили, або сума прикладених сил рівна нулеві, то таке тіло знаходиться в стані спокою, або прямолінійного рівномірного руху ___.",
            "formulas": [
              "\\sum_{i} \\vec{F}_i = 0 \\implies \\vec{v} = \\text{const}"
            ]
          },
          {
            "text": "Інерційні системи відліку – системи відліку, які знаходяться в стані спокою, або рівномірного прямолінійного руху одна відносно одної.",
            "formulas": []
          },
          {
            "text": "Принцип відносності Галілея – всі фізичні процеси в інерційних системах протікають однаково. Час є абсолютним – одним і тим же у всіх системах відліку.",
            "formulas": []
          },
          {
            "text": "Сила – векторна фізична величина, що характеризує ступінь взаємодії тіл.",
            "formulas": []
          },
          {
            "text": "Другий закон Ньютона – якщо на тіло діє сила, то воно рухається з прискоренням направленим по напряму сили і величиною пропорційною величині прикладеної сили ___ , де m - маса тіла. Інші форми запису закону ___, ___, де ___ – імпульс тіла. В цьому законі маса тіла виступає в ролі міри інерції тіла. В системі СІ одиниця маси - кілограм (1 кг). Одиниця вимірювання сили визначається одиницями довжини, часу і маси ___ і називається ньютон (1 Н).",
            "formulas": [
              "\\vec{a} = \\frac{\\vec{F}}{m}",
              "\\vec{F} = m\\vec{a}",
              "\\vec{F} = \\frac{m \\Delta \\vec{v}}{\\Delta t} = \\frac{\\Delta \\vec{p}}{\\Delta t}",
              "\\vec{p} = m \\vec{v}",
              "\\frac{\\text{kg} \\cdot \\text{m}}{c^2}"
            ]
          },
          {
            "text": "Якщо на тіло діє декілька сил, то результуюча сила знаходиться за правилом додавання векторів.",
            "formulas": []
          },
          {
            "text": "Третій закон Ньютона – сили, з якими взаємодіють два тіла, одинакові за величиною і протилежні за напрямком ___. (Зверніть увагу, що дані сили прикладені до різних тіл)",
            "formulas": [
              "\\vec{F}_{12} = -\\vec{F}_{21}"
            ]
          },
          {
            "text": "Гравітаційна сила притягання властива тілам, які мають масу.",
            "formulas": []
          },
          {
            "text": "Закон всесвітнього тяжіння (четвертий закон Ньютона) – два тіла з масою притягуються між собою з силою, пропорційною масам тіл і обернено пропорційною квадрату відстані між ними ___ , де коефіцієнт пропорційності ___ , який називається гравітаційною сталою. Тут маса тіла виступає у ролі джерела гравітаційної взаємодії.",
            "formulas": [
              "F = G \\frac{m_1 m_2}{R^2}",
              "G = 6.6720 \\cdot 10^{-11} \\text{ Н} \\cdot (\\text{м}^2/\\text{кг}^2)"
            ]
          },
          {
            "text": "Сила тяжіння – гравітаційна сила, з якою Земля притягує до себе тіла ___, де m – маса тіла, g – прискорення вільного падіння направлене до центру Землі, числове значення якого залежить від маси і радіусу Землі, географічної широти місцевості і висоти над земною поверхнею ___.",
            "formulas": [
              "F_т = mg",
              "g = G \\frac{M_з}{(R_з + h)^2}"
            ]
          },
          {
            "text": "Якщо на тіло діє тільки сила тяжіння, то тіло здійснює вільне падіння. Вид траєкторії тіла залежить від напрямку і величини початкової швидкості. Коли початкова швидкість рівна нулю або паралельна силі тяжіння, діло здійснює прямолінійний рух по вертикалі. Якщо початкова швидкість напрямлена під кутом до сили тяжіння, то тіло здійснює вільне падіння по вертикалі з початковою вертикальною складовою швидкості та рівномірний рух по горизонталі з початковою горизонтальною складовою швидкості. Результуюча траєкторія має вид параболи.",
            "formulas": []
          },
          {
            "text": "Вага тіла – сила з якою тіло діє на підставку чи підвіс внаслідок тяжіння. Якщо тіло нерухоме, або рухається рівномірно і прямолінійно, то вага тіла ___ , якщо тіло рухається з прискоренням ___, то вага тіла ___. Тут ___ – проекція вектора прискорення на вертикальну вісь направлену до центру Землі.",
            "formulas": [
              "P = F_т = mg",
              "a_z",
              "P = m(g - a_z)",
              "a_z"
            ]
          },
          {
            "text": "Невагомість виникає у разі вільного падіння (з прискоренням ___), в результаті чого тіло діє з нульовою силою на підставку або підвіс.",
            "formulas": [
              "a_z = g"
            ]
          },
          {
            "text": "Штучний супутник – об’єкт поміщений на орбіту Землі або іншого небесного тіла зусиллями людини. Рух супутника по орбіті обумовлений гравітаційною силою.",
            "formulas": []
          },
          {
            "text": "Перша космічна швидкість – швидкість, яку, нехтуючи опором повітря, необхідно надати тілу, щоб воно рухалось по круговій орбіті з радіусом рівним радіусу Землі -  ___ , (для Землі ___, ___) і чисельно рівна ___.",
            "formulas": [
              "v_1 = \\sqrt{G \\frac{M_з}{R_з}} = \\sqrt{g \\cdot R_з}",
              "М_з=5,97\\cdot10^{24} \\text{кг}",
              "R_з=6 378 000 м",
              "v_1 = 7,9 \\text{км/с}"
            ]
          },
          {
            "text": "Сила пружності – сила, що виникає при деформації твердого тіла, яка намагається відновити початкову форму тіла.",
            "formulas": []
          },
          {
            "text": "Закон Гука – деформація в пружних тілах (видовження або стиснення) прямо пропорційна силі, яка визиває дану деформацію ___ , де k – коефіцієнт жорсткості тіла (розмірність Н/м ), Δx – величина деформації.",
            "formulas": [
              "\\vec{F} = -k \\Delta x\n"
            ]
          },
          {
            "text": "Сила тертя виникає під час руху одного тіла по поверхні іншого і направлена вздовж поверхні дотику тіл проти відносної швидкості їхнього руху. Сила тертя залежить від: відносної швидкості руху тіл; речовини, з якої складаються тіла; стану поверхонь (твердих) тіл; розмірів і форми тіла (при русі в газі або рідині); ваги тіла.",
            "formulas": []
          },
          {
            "text": "Сила тертя ковзання направлена проти напряму руху тіла і прямо пропорційна силі реакції опори ___ , де безрозмірний коефіцієнт тертя μ залежить від природи та якості поверхонь, що дотикаються, N – нормальна складова реакції опори.",
            "formulas": [
              "F_{тр} = \\mu \\cdot N"
            ]
          },
          {
            "text": "Сила тертя спокою | 𝐹 | ≤ 𝜇 ∙ 𝑁 . Сила тертя спокою перешкоджає початкові руху тіла.",
            "formulas": []
          },
          {
            "text": "Сила тертя кочення прямо пропорційна реакції опори N і обернено пропорційна радіусу тіла кочення R; ___ , де f – коефіцієнт тертя кочення (розмірність – м)",
            "formulas": [
              "F = \\frac{f}{R} \\cdot N"
            ]
          },
          {
            "text": "Момент сили – векторна величина, рівна добутку сили на величину плеча прикладання сили відносно осі або точки обертання. Напрям моменту сили направлений перпендикулярно до площини, яку утворюють вектор сили і радіус-вектор точки прикладання сили ___ . Розмірність моменту сили ___ .",
            "formulas": [
              "\\vec{M} = [\\vec{r} \\times \\vec{F}]",
              "м \\cdot Н = \\text{кг} \\cdot \\text{м}^2 / \\text{с}^2"
            ]
          },
          {
            "text": "Умови рівноваги тіл: для рівноваги тіл необхідне виконання двох умов: 1) векторна сума прикладених до тіл сил повинна дорівнювати нулю ___ ; 2) векторна сума моментів прикладених до тіла сил (відносно осі або точки) повинна дорівнювати нулю ___ ;",
            "formulas": [
              "\\vec{F}_1 + \\vec{F}_2 + \\vec{F}_3 + \\cdots = \\sum \\vec{F}_i = 0",
              "\\vec{M}_1 + \\vec{M}_2 + \\vec{M}_3 + \\cdots = \\sum \\vec{M}_i = 0"
            ]
          },
          {
            "text": "Рівновага – стан тіла, за якого в розглядуваній системі відліку відсутнє переміщення будь-якої його точки під дією прикладених до нього сил. Рівновага буває стійкою, нестійкою і байдужою",
            "formulas": []
          }
        ]
      },
      {
        "themeName": "Елементи механіки рідин та газів",
        "themeRoute": "elementsMechanicsLiquidsGases",
        "info": [
          {
            "text": "Тиск – скалярна фізична величина, обумовлена дією сили F на поверхню площею S; ___ одиницю тиску ___ називають паскаль (1 Па).",
            "formulas": [
              "p = \\frac{F}{S}",
              "\\frac{\\text{Н}}{\\text{м}^2}"
            ]
          },
          {
            "text": "Закон Паскаля – в рідинах і газах тиск передається у всі сторони одинаково.",
            "formulas": []
          },
          {
            "text": "Атмосферний тиск - тиск, з яким атмосфера Землі діє на земну поверхню і всі тіла, що на ній розташовані.",
            "formulas": []
          },
          {
            "text": "Внаслідок притягання до Землі рідина тисне на дно і стінки посудини ___ , де ___ – зовнішній тиск на рідину (наприклад, атмосферний), ___ - густина рідини, g - прискорення вільного падіння, h - висота стовпа рідини.",
            "formulas": [
              "p = p_0 + \\rho g h",
              "p_0",
              "\\rho"
            ]
          },
          {
            "text": "Закон Архімеда – на тіло занурене в рідину або газ діє виштовхувальна сила (сила Архімеда), яка направлена вертикально вгору і чисельно рівна вазі рідини або газу, витісненої тілом; ___ , де ___ – густина рідини або газу, V - частина обєму тіла занурена в середовище, ___ - прискорення вільного падіння.",
            "formulas": [
              "F_A = \\rho Vg",
              "\\rho",
              "g"
            ]
          },
          {
            "text": "Умови плавання тіл – суцільні тіла плавають в рідині, якщо їх густина менше густини рідини.",
            "formulas": []
          }
        ]
      },
      {
        "themeName": "Закони збереження в механіці",
        "themeRoute": "conservationLawsMechanics",
        "info": [
          {
            "text": "Імпульс тіла – векторна фізична величина,яка характиризує стан руху тіла, чисельно рівна добутку швидкості на масу тіла ___ . Розмірність імпульсу ___ .",
            "formulas": [
              "\\vec{p} = m \\vec{V}",
              "\\frac{\\text{кг} \\cdot \\text{м}}{\\text{с}}"
            ]
          },
          {
            "text": "Закон збереження імпульсу – у замкнутій (ізольованій) системі сума імпульсів тіл за будь-яких взаємодій між ними залишається сталою ___ .",
            "formulas": [
              "\\vec{p}_1 + \\vec{p}_2 + \\vec{p}_3 + \\dots + \\vec{p}_n = \\vec{p}'_1 + \\vec{p}'_2 + \\dots + \\vec{p}'_{n'}"
            ]
          },
          {
            "text": "Реактивний рух – рух, що виникає внаслідок відкидання частини маси тіла. При такому русі виконується закон збереження імпульсу початкової системи ___ ; швидкість V направлена проти руху відкинутого тіла.",
            "formulas": [
              "(M - m)V + mv = 0 \\implies V = -\\frac{mv}{M - m}"
            ]
          },
          {
            "text": "Механічна робота – скалярна фізична величина, чисельно рівна скалярному добутку сили на величину зміщення, на якому діяла дана сила ___ . Розмірність роботи ___ і одиниця в системі СІ називається джоуль (1 Дж).",
            "formulas": [
              "A = \\vec{F} \\cdot \\vec{\\Delta x} = F \\cdot \\Delta x \\cdot \\cos(\\alpha)",
              "\\text{Н} \\cdot \\text{м} = \\frac{\\text{кг} \\cdot \\text{м}^2} {\\text{с}^{2}}"
            ]
          },
          {
            "text": "Кінетична енергія тіла – скалярна фізична величина, яка визначається рухом тіла ___ . Розмірність енергії і роботи співпадають.",
            "formulas": [
              "E_k = \\frac{mv^2}{2} = \\frac{p^2}{2m}"
            ]
          },
          {
            "text": "Потенціальна енергія – скалярна величина, яка визначається взаємним розміщенням взаємодіючих тіл: a)потенціальна енергія тіла на висоті h в полі тяжіння Землі ___ ; б)потенціальна енергія деформованої пружини ___ ;",
            "formulas": [
              "E_п = mgh",
              "E_п = \\frac{k \\Delta x^2}{2}"
            ]
          },
          {
            "text": "Закон збереження енергії в механічних процесах – у довільний момент руху повна енергія тіла є величиною сталою ___ .",
            "formulas": [
              "E_к + E_п = E'_к + E'_п"
            ]
          },
          {
            "text": "Потужність – скалярна фізична величина, що характеризує швидкість виконання роботи (робота, що виконується за одиницю часу) ___ ;  де А – робота, виконана за проміжок часу Δt. Одиниця потужності називається ват (1 Вт).",
            "formulas": [
              "N = \\frac{A}{\\Delta t} = \\frac{F \\cdot s}{\\Delta t} = F \\cdot v"
            ]
          },
          {
            "text": "Коефіцієнт корисної дії – вказує, яка частина виконаної механізмом роботи є корисною ___ ; ___ – корисна робота, ___ – повна виконана робота.",
            "formulas": [
              "\\eta = \\frac{A_k}{A} \\cdot 100\\%",
              "A_k",
              "A"
            ]
          },
          {
            "text": "Прості механізми – пристрої, що дають можливість виконати роботу прикладаючи меншу силу (або змінити напрям прикладання сили на більш зручний). Традиційно виділяють шість простих механізмів: Важіль; Колесо; Блок; Похила площина; Клин; Гвинт.",
            "formulas": []
          }
        ]
      },
      {
        "themeName": "Механічні коливання і хвилі",
        "themeRoute": "mechanicalVibrationsWaves",
        "info": [
          {
            "text": "Коливальний рух – коли тіло періодично повертається до початкового стану. Характеризується періодом коливань Т, сек; частотою коливань ν, ___≡ Гц (також вживають циклічну частоту ω=2πν), амплітудою.",
            "formulas": [
              "{сек}^{-1}"
            ]
          },
          {
            "text": "Вільні механічні коливання – коли до тіла не підводять зовні енергію.",
            "formulas": []
          },
          {
            "text": "Гармонічні коливання – які описуються синусоподібною функцією (зміщення тіла x(t)); 𝑥(𝑡) = 𝐴 ∙ sin(𝜔𝑡 + 𝛼), де А – амплітуда коливань, ω – циклічна частота, α – початкова фаза. Величину ωt+α називають фазою коливань.",
            "formulas": []
          },
          {
            "text": "Рівномірний рух по колу і гармонічні коливання. Рівномірний рух по колу можна представити як коливний рух по двом взаємно ортогональним осям; 𝑥(𝑡) = 𝑅 ∙ sin(𝜔𝑡 + 𝛼); 𝑦(𝑡) = 𝑅 ∙ cos (𝜔𝑡 + 𝛼)",
            "formulas": []
          },
          {
            "text": "Коливання вантажу на пружині має наступні параметри ___, ___ , де k – жорсткість пружини, m – маса вантажу.",
            "formulas": [
              "\\omega = \\sqrt{\\frac{k}{m}}",
              "T = 2\\pi \\sqrt{\\frac{m}{k}}"
            ]
          },
          {
            "text": "Математичний маятник – коливання матеріального точкового тіла на невагомій нерозтяжній нитці. Кутова частота і період коливань задаються формулами ___, ___, де l – довжина маятника, g – прискорення вільного падіння.",
            "formulas": [
              "\\omega = \\sqrt{\\frac{g}{l}}",
              "T = 2\\pi \\sqrt{\\frac{l}{g}}"
            ]
          },
          {
            "text": "Перетворення енергії при гармонічних коливаннях – сума кінетичної і потенціальної енергії тіла є стала величина рівна значенню заданому в початковий момент тілу, що коливається. ___; В точках повороту (де швидкість тіла рівна нулю) вся енергія переходить в потенціальну, а в точці рівноваги кінетична енергія досягає максимального значення (потенціальна енергія рівна нулю).",
            "formulas": [
              "E_k + E_p = \\text{const}"
            ]
          },
          {
            "text": "Вимушені коливання – відбуваються під дією періодичної зовнішньої сили ___; Коливальна система має власну частоту коливань ω. Коли частота зовнішньої сили Ω співпадає з частотою власних коливань ω – наступає резонанс в коливальній системі; амплітуда коливань сильно зростає по зрівнянню з не резонансною амплітудою.",
            "formulas": [
              "F(t) = F_0 \\sin (\\Omega t)"
            ]
          },
          {
            "text": "В пружних середовищах коливання одної частини викликає коливання сусідніх частин. Процес поширення коливань в пружних середовищах називають хвилею. Хвиля характеризується двома напрямами – напрямом в якому коливаються частинки середовища і напрямом поширення цих коливань. Якщо напрям коливань співпадає з напрямом поширення хвилі – це повздовжні хвилі. Якщо напрям коливань ортогональний напряму поширення хвилі – це поперечні хвилі.",
            "formulas": []
          },
          {
            "text": "Хвиля як і коливання характеризується частотою і періодом коливань, а також довжиною хвилі і швидкістю поширення хвилі. 𝜆 = 𝑣 ∙ 𝑇 , де λ – довжина хвилі, v- швидкість хвилі, T – період хвилі.",
            "formulas": []
          },
          {
            "text": "Рівняння хвилі, яка поширюється по осі х: ___ де y – величина відхилення тіла коливання, що розташовано в точці x в момент часу t, A – амплітуда коливань, k – хвильове число ___",
            "formulas": [
              "𝑦(𝑥, 𝑡) = 𝐴 ∙ sin(𝜔𝑡 − 𝑘𝑥)",
              "𝑘 = 2𝜋/𝜆"
            ]
          },
          {
            "text": "Звукові хвилі – хвилі з частотою від 16-20 Гц до 20 кГц, які поширюються в газі (повздовжні), рідині (повздовжні) або твердому тілі. Нижчі частоти – це інфразвукові хвилі, вищі частоти – ультразвук. Фізичній характеристиці звуку – частоті – відповідає фізіологічна характеристика – висота тону. Амплітуда звукових коливань задає гучність звуку.",
            "formulas": []
          },
          {
            "text": "Швидкість звуку залежить від густини середовища, в якому він розповсюджується ___",
            "formulas": [
              "v_{газ}<v_{рідина}<v_{тв.тіло}"
            ]
          }
        ]
      }
    ]
  },
  {
    "id": 1,
    "sectionName": "Молекулярна фізика і термодинаміка",
    "routeName": "molecular_thermodynamics",
    "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/Stylised_atom_with_three_Bohr_model_orbits_and_stylised_nucleus.svg/1200px-Stylised_atom_with_three_Bohr_model_orbits_and_stylised_nucleus.svg.png",
    "img_alt": "molecular thermodynamics",
    "themes": [
      {
        "themeName": "Основи молекулярно - кінетичної теорії",
        "themeRoute": "fundamentalsMolecular-kineticTheory",
        "info": [
          {
            "text": "Основні положення МКТ: а) речовина складається з молекул – найменших частинок, які мають всі ознаки речовини; доказом молекулярної будови речовини є дифузія, закон збереження маси, кратні відношення і кратні об’єми при хімічних реакціях; б) молекули взаємодіють між собою посередством міжмолекулярних сил, що залежать від відстані між молекулами і мають характер притягання і відштовхування; доказом цього положення є наявність пружності тіл, поверхневого натягу в рідинах; в) молекули знаходяться в неперервному хаотичному (тепловому) русі; доказом теплового руху є броунівський рух, дифузія, випаровування та ін.",
            "formulas": []
          },
          {
            "text": "Моль речовини – маса речовини в грамах, що співпадає з відносною молекулярною масою і визначається хімічною формулою речовини. (наприклад, для води Н2О відносна молекулярна маса М=2∙1+16=18 ). Моль любої речовини містить одне і те саме число молекул, яке називають числом (сталою) Авогадро. ___",
            "formulas": [
              "N_A = 6.022 \\times 10^{23} \\text{mol}^{-1}"
            ]
          },
          {
            "text": "Число молекул у тілі масою 𝑚 ___ де М – молярна маса речовини тіла, ___ – стала Авогадро.",
            "formulas": [
              "N = \\frac{N_A \\cdot\\ m}{M}",
              "N_A"
            ]
          },
          {
            "text": "Маса одної молекули речовини буде рівна ___",
            "formulas": [
              "m_0 = \\frac{m}{N} = \\frac{M}{N_A}"
            ]
          },
          {
            "text": "Розмір молекули можна оцінити по величині об’єму, який припадає на 1 молекулу ___ і прирівнявши його об’єму шару радіуса r (___) . Для молекули води, наприклад, отримаємо ___",
            "formulas": [
              "V_0 = \\frac{V}{N} = \\frac{VM}{m} \\cdot N_A = \\frac{M}{\\rho} \\cdot N_A",
              "V = \\frac{4}{3} \\pi r^3",
              "r \\approx 1.9 \\times 10^{-10} \\text{m}"
            ]
          },
          {
            "text": "Молекули речовини знаходяться в безперервному хаотичному усі із різними швидкостями, які підкоряються певному статистичному розподілу (розподілу Максвелла). Квадратний корінь із середнього квадрата швидкості молекули називають середньою квадратичною швидкістю ___, або ___, де m0 - маса молекули, k - стала Больцмана (___), T- температура речовини.",
            "formulas": [
              "\\overline{v^2} = \\frac{3kT}{m_0}",
              "v_{ск} = \\sqrt{\\overline{v^2}} = \\sqrt{\\frac{3kT}{m_0}}",
              "1.38 \\times 10^{-23} \\text{ Дж/K }"
            ]
          },
          {
            "text": "Ідеальний газ – газ, в якому нехтують взаємодією молекул між собою. Енергія газу складається тільки з кінетичної енергії молекул (відсутня потенціальна енергія взаємодії молекул між собою).",
            "formulas": []
          },
          {
            "text": "Основне рівняння молекулярно-кінетичної теорії газу: тиск, що створюють молекули газу на стінки посудини становить ___ де n – концентрація молекул газу, m0 – маса молекули газу (ρ – густина газу), ___ − середнє значення квадрату швидкості.",
            "formulas": [
              "p = \\frac{1}{3} n m_0 \\overline{v^2} = \\frac{1}{3} \\rho \\overline{v^2}",
              "\\overline{v^2}"
            ]
          },
          {
            "text": "Фізичний зміст температури в МКТ: температура речовини відображає середню кінетичну енергію молекул, а саме, ___. де k – константа Больцмана, Т- абсолютна температура речовини.",
            "formulas": [
              "\\overline{E} = \\frac{3}{2} kT"
            ]
          },
          {
            "text": "Зв'язок абсолютної температури Т і температури в шкалі Цельсія t (градус шкали Цельсія рівний градусу абсолютної шкали температур) T = t + 273 .",
            "formulas": []
          },
          {
            "text": "Внутрішня енергія одноатомного ідеального газу ___, де N-число молекул газу. Зауважте, що внутрішня енергія ідеального газу не залежить від величини об’єму V, який займає газ.",
            "formulas": [
              "U = \\frac{3}{2} NkT"
            ]
          },
          {
            "text": "Зв'язок газової сталої R та константи Больцмана k ___. Чисельне значення газової сталої рівне 𝑹 = 𝟖, 𝟑𝟏 Дж/моль∙К",
            "formulas": [
              "R = kN_A"
            ]
          },
          {
            "text": "Рівняння стану ідеального газу ___",
            "formulas": [
              "pV = \\frac{m}{M} RT"
            ]
          },
          {
            "text": "Рівняння ізотерми (Т=const) ___",
            "formulas": [
              "p_1 V_1 = p_2 V_2 = \\text{const}"
            ]
          },
          {
            "text": "Рівняння ізобари (p=const) ___",
            "formulas": [
              "\\frac{V_1}{T_1} = \\frac{V_2}{T_2} = \\text{const}"
            ]
          },
          {
            "text": "Рівняння ізохора (V=const) ___",
            "formulas": [
              "\\frac{p_1}{T_1} = \\frac{p_2}{T_2} = \\text{const}"
            ]
          }
        ]
      },
      {
        "themeName": "Основи термодинаміки.",
        "themeRoute": "fundamentalsThermodynamics",
        "info": [
          {
            "text": "Оскільки кінетична енергія хаотичного руху молекул визначає температуру речовини, то цей рух ще називають тепловим рухом.",
            "formulas": []
          },
          {
            "text": "Внутрішня енергія тіла – це кінетична енергія руху молекул і потенціальна енергія взаємодії молекул між собою. Внутрішню енергію можна змінювати зміною температури тіла (підводом тепла) або зміною об’єму, який займає газ (виконання над газом роботи). Тобто внутрішня енергія тіла однозначно визначається температурою Т та об’ємом тіла V, що характеризує його стан U=U(T,V).",
            "formulas": []
          },
          {
            "text": "Питома теплоємність – кількість теплоти, яку треба підвести до тіла одиничної маси, щоб підвищити його температуру на один градус ___ , де Q – теплота підведена до тіла масою m, ΔT – зміна температури тіла в наслідок підводу тепла.",
            "formulas": [
              "C = \\frac{Q}{m \\Delta T}"
            ]
          },
          {
            "text": "Робота газу при розширенні (при сталому тиску) ___ . На діаграмі термодинамічного процесу в координатах (p,V) робота чисельно рівна площі фігури утвореною лінією процесу, віссю V і лініями, що фіксують зміну об’єму.",
            "formulas": [
              "A = p(V_2 - V_1) = p \\Delta V"
            ]
          },
          {
            "text": "Перше начало термодинаміки: теплота передана тілу іде на збільшення внутрішньої енергії тіла та виконання тілом роботи 𝑄 = ∆𝑈 + 𝐴 (Q>0 – до системи підводять тепло, Q<0 – від системи відводять тепло, A>0 – система виконує роботу, A<0 – над системою виконують роботу).",
            "formulas": []
          },
          {
            "text": "Адіабатичний процес – це термодинамічний процес, що відбувається в теплоізольованій системі, тобто за відсутності теплообміну з навколишніми тілами ( Q=0 ).",
            "formulas": []
          },
          {
            "text": "Самоплинні теплові процеси є незворотніми (більш нагріті тіла передають теплоту менш нагрітим тілам, а не навпаки).",
            "formulas": []
          },
          {
            "text": "При роботі теплового двигуна до нього підводиться від нагрівника теплота ___, частина якої перетворюється двигуном в роботу А, а частина тепла q віддається зовнішньому охолоджувачу.",
            "formulas": [
              "Q_П"
            ]
          },
          {
            "text": "Коефіцієнт корисної дії теплової машини ___ де ___ – теплота підведена в циклі, А – робота виконана за цикл (A=___ – q). На діаграмі термодинамічного циклу роботатеплової машини за цикл чисельно рівна площі, обмеженої графіком циклу.",
            "formulas": [
              "\\eta = \\frac{A}{Q_П}",
              "Q_П",
              "Q_П"
            ]
          },
          {
            "text": "Коефіцієнт корисної дії циклу Карно (дві ізотерми і дві адіабати) не залежить від природи робочого тіла, а визначається тільки температурами нагрівника і холодильника ___ , де ___ і ___ – температури нагрівника і холодильника.",
            "formulas": [
              "\\eta = \\frac{T_н - T_х}{T_н}",
              "Т_н",
              "Т_х"
            ]
          },
          {
            "text": "Ккд циклу Карно має максимальне значення серед всіх циклів, які працюють між тими ж температурами.",
            "formulas": []
          }
        ]
      },
      {
        "themeName": "Властивості газів, рідин і твердих тіл",
        "themeRoute": "propertiesGasesLiquidsSolids",
        "info": [
          {
            "text": "Пароутворення – перехід рідини у газоподібний стан, може відбуватися з вільної поверхні рідини або всередині її об’єму, під час кипіння.",
            "formulas": []
          },
          {
            "text": "Для випаровування рідини маси m під час кипіння необхідно підвести теплоту 𝑄 = 𝑟 ∙ 𝑚, де r – питома теплота пароутворення (вимірюється в Дж/кг). Кипіння відбувається при сталій температурі.",
            "formulas": []
          },
          {
            "text": "Конденсація – зворотній процес до пароутворення. При конденсації виділяється така ж кількість теплоти.",
            "formulas": []
          },
          {
            "text": "Насичена пара знаходиться в термодинамічній рівновазі з рідиною – середня кількість молекул, які вилітають з рідини рівна середній кількості молекул, які з пари влітають в рідину. При ненасиченій парі така рівновага порушена в ту чи іншу сторону.",
            "formulas": []
          },
          {
            "text": "Відносна вологість повітря – це відношення парціального тиску водяної пари ___ до тиску насиченої пари ___ за тієї самої температури ___",
            "formulas": [
              "p",
              "p_н",
              "\\varphi = \\frac{p}{p_н} \\cdot 100 \\%"
            ]
          },
          {
            "text": "Для плавлення кристалічного тіла маси m необхідно підвести теплоту при сталій температурі 𝑄 = 𝜆 ∙ 𝑚, де λ – питома теплота плавлення (вимірюється в Дж/кг).",
            "formulas": []
          },
          {
            "text": "Тверднення тіл відбувається при сталій температурі з виділенням такої ж кількості тепла.",
            "formulas": []
          },
          {
            "text": "При згоранні маси палива m виділяється теплота 𝑄 = 𝑞 ∙ 𝑚, де q- питома теплота згорання (вимірюється в Дж/кг).",
            "formulas": []
          },
          {
            "text": "Щоб перетворити рідину маси m у пару, потрібно підвести теплоту Q1 для нагрівання рідини до температури кипіння, потім підвести теплоту Q2 для перетворення рідини в пару 𝑄 = 𝑄1 + 𝑄2 = 𝑐𝑚∆𝑡 + 𝑟𝑚.",
            "formulas": []
          },
          {
            "text": "Для розплавлення тіла маси m потрібно спочатку нагріти його до температури плавлення, а потім підводити теплоту плавлення 𝑄 = 𝑄1 + 𝑄2 = 𝑐𝑚∆𝑡 + 𝜆𝑚.",
            "formulas": []
          },
          {
            "text": "Молекули поверхневого шару рідини мають надлишкову потенціальну енергію Uп, яку називають поверхневою енергією. Величину відношення поверхневої енергії до площі поверхні S називають поверхневим натягом σ,  𝜎 = 𝑈п / 𝑆, одиниці вимірювання - Дж/м^2",
            "formulas": []
          },
          {
            "text": "Сила поверхневого натягу F=σ∙l, де l – довжина лінії змочування.",
            "formulas": []
          },
          {
            "text": "Додатковий тиск в рідині зі сферичною поверхнею (лапласівський тиск) ___ де σ – коефіцієнт поверхневого натягу рідини, R – радіус кривизни поверхні.",
            "formulas": [
              "p_л = \\frac{2 \\sigma}{R}"
            ]
          },
          {
            "text": "Висота рівня рідини (густини ρ) в капілярі радіуса r ___ , де g – прискорення вільного падіння.",
            "formulas": [
              "h = \\frac{2 \\sigma}{\\rho g r}"
            ]
          },
          {
            "text": "В кристалічних тілах молекули впорядковано розміщені на значних відстанях (метали, кухонна сіль, цукор, алмаз,…).",
            "formulas": []
          },
          {
            "text": "В аморфних тілах молекули розташовані без певного порядку (скло, віск, пластмаса,…).",
            "formulas": []
          },
          {
            "text": "Тверді тіла називають пружними, якщо після припинення дії зовнішніх сил тіло повністю відновлює свою форму і пластичними, коли тіло зберігає (частково чи повністю) спричинену деформацію.",
            "formulas": []
          },
          {
            "text": "Крихкість - властивість тіла руйнуватися при незначних деформаціях. Твердість характеризує спротив пластичних тіл до деформації.",
            "formulas": []
          },
          {
            "text": "Розрізняють такі деформації - розтяг і стискання, деформацію згину, крутіння, зсуву.",
            "formulas": []
          },
          {
            "text": "Деформації розтягу і стискання пружних тіл описуються законом Гука 𝐹 = −𝑘∆𝑙, де Δl – величина деформації, k – коефіцієнт жорсткості тіла.",
            "formulas": []
          },
          {
            "text": "Коефіцієнт жорсткості залежить від площі поперечного перерізу S та початкової довжини тіла l,  ___, або ___ , де E - модуль Юнга.",
            "formulas": [
              "k \\sim \\frac{S}{l}",
              "k = \\frac{E \\cdot S}{l}"
            ]
          }
        ]
      }
    ]
  },
  {
    "id": 2,
    "sectionName": "Електродинаміка",
    "routeName": "electrodynamics",
    "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/VFPt_Solenoid_correct2.svg/2560px-VFPt_Solenoid_correct2.svg.png",
    "img_alt": "electrodynamics",
    "themes": [
      {
        "themeName": "Основи електростатики.",
        "themeRoute": "basicsElectrostatics",
        "info": [
          {
            "text": "",
            "formulas": []
          }
        ]
      },
      {
        "themeName": "Закони постійного струму.",
        "themeRoute": "lawsDirectCurrent",
        "info": [
          {
            "text": "",
            "formulas": []
          }
        ]
      },
      {
        "themeName": "Електричний струм у різних середовищах.",
        "themeRoute": "electricCurrentDifferentEnvironments",
        "info": [
          {
            "text": "",
            "formulas": []
          }
        ]
      },
      {
        "themeName": "Магнітне поле, електромагнітна індукція. Взаємодія",
        "themeRoute": "magneticField",
        "info": [
          {
            "text": "",
            "formulas": []
          }
        ]
      }
    ]
  },
  {
    "id": 3,
    "sectionName": "Електромагнітні коливання і хвилі. Оптика",
    "routeName": "electromagnetic_optics",
    "img": "https://disted.edu.vn.ua/media/images/konstantin22/9/img572.jpg",
    "img_alt": "electromagnetic_optics",
    "themes": [
      {
        "themeName": "Електромагнітні коливання і хвилі.",
        "themeRoute": "electromagneticVibrationsWaves",
        "info": [
          {
            "text": "Коливальний контур – електричне коло, що складається з котушки індуктивністю L та конденсатора ємністю С. Вільні електромагнітні коливання відбуваються в контурі в якому попередньо заряджають конденсатор і в подальшому до контуру не підводять енергію.",
            "formulas": []
          },
          {
            "text": "В контурі попередньо задана електрична енергія конденсатора ___ , перетворюється в енергію магнітного поля котушки ___ , коли конденсатор повністю розрядиться, потім знову в енергію електричного поля і т.д. В ідеальному контурі, в якому нема активного опору (R=0) такі коливання будуть відбуватися нескінченно довго.",
            "formulas": [
              "W_C = \\frac{CU^2}{2} = \\frac{Q^2}{2C}",
              "W_L = \\frac{LI^2}{2}"
            ]
          },
          {
            "text": "Період і частота коливань в ідеальному контурі рівні ___ , ___, і називаються власним періодом і власною частотою контура.",
            "formulas": [
              "T = 2 \\pi \\sqrt{\\frac{L}{g}}",
              "f = \\frac{1}{2\\pi\\sqrt{LC}}"
            ]
          },
          {
            "text": "Зв'язок сили струму і напруги в ідеальному контурі ___ . Знаменник даного виразу має розмірність опору і називається хвильовим опором.",
            "formulas": [
              "I_{max} = \\frac{U_{max}}{\\sqrt{L/C}}"
            ]
          },
          {
            "text": "Коливання в контурі з активним опором R, ___ , і ці коливання будуть затухаючими.",
            "formulas": [
              "T = \\frac{2 \\pi}{\\sqrt{\\frac{1}{LC} - \\left( \\frac{R}{2L} \\right)^2}}"
            ]
          },
          {
            "text": "Вимушені коливання підтримуються періодичним підведенням енергії ззовні для компенсації втрат.",
            "formulas": []
          },
          {
            "text": "Магнітний потік і електрорушійна сила індукції в рамці що обертається ___ , ___",
            "formulas": [
              "\\Phi = BS \\cos(\\omega t)",
              "\\mathcal{E} = -\\frac{\\Delta \\Phi}{\\Delta t} = BS\\omega \\sin(\\omega t)"
            ]
          },
          {
            "text": "Змінний струм і напруга в колі лише з активним навантаженням ___ , ___",
            "formulas": [
              "I(t) = I_{max} \\sin(\\omega t)",
              "U(t) = U_{max} \\sin(\\omega t)"
            ]
          },
          {
            "text": "Змінний струм і напруга в колі з активним і реактивними навантаженнями можуть відрізнятися фазами коливань ___ , ___ , а саме, напруга на активній та реактивних нагрузках ___ , ___ , ___ , ___",
            "formulas": [
              "I(t) = I_{max} \\sin\\omega t",
              "U(t) = U_{max} \\sin(\\omega t + 𝜑)",
              "U_R(t) = I_{max}R \\sin(\\omega t)",
              "U_L(t) = I_{max} R_L \\sin(\\omega t + \\frac{\\pi}{2})",
              "U_C(t) = I_{max} R_C \\sin(\\omega t - \\frac{\\pi}{2})",
              "I = \\frac{U}{\\sqrt{R^2 + (R_L - R_C)^2}}"
            ]
          },
          {
            "text": "Опори реактивних індуктивного і ємнісного навантажень ___ , ___",
            "formulas": [
              "R_L = \\omega L",
              "R_C = \\frac{1}{\\omega C}"
            ]
          },
          {
            "text": "Резонанс в колі із змінним струмом наступає, коли 𝑅𝐿 = 𝑅𝐶, або ___",
            "formulas": [
              "\\omega_{rez} = \\frac{1}{\\sqrt{LC}}"
            ]
          },
          {
            "text": "Зсув фаз між напругою і силою струму ___",
            "formulas": [
              "\\tan(\\varphi) = \\frac{R_L - R_C}{R}"
            ]
          },
          {
            "text": "Потужність змінного струму за період ___",
            "formulas": [
              "W = \\frac{\\mathcal{E}_{max} \\mathcal{I}_{max}}{2} \\cos(\\varphi)"
            ]
          },
          {
            "text": "Формула трансформатора ___ , ___",
            "formulas": [
              "\\frac{U_1}{U_2} = \\frac{n_1}{n_2}",
              "I_1 U_1 \\approx I_2 U_2"
            ]
          },
          {
            "text": "При передачі струму на великі відстані відбувається втрата потужності ___ , де ___ - потужність сторонніх сил (електростанції), ___ - напруга, при якій передається струм, r - опір ліній електропередачі.",
            "formulas": [
              "P_B = \\frac{P^2}{(U_{ab})^2} \\cdot r",
              "P^2",
              "U_{ab}"
            ]
          },
          {
            "text": "Змінне електричне поле породжує змінне магнітне поле і навпаки. Поширення в просторі змінного електричного і магнітного полів, або електромагнітного поля, представляє собою електромагнітну хвилю.",
            "formulas": []
          },
          {
            "text": "Рівняння електромагнітної хвилі ___ , ___ , де ___ і ___ – амплітуди хвилі, t - час спостереження, х - відстань спостереження, с - швидкість хвилі.",
            "formulas": [
              "E = E_0 \\sin \\left[ \\omega \\left( t - \\frac{x}{c} \\right) \\right]",
              "B = B_0 \\sin \\left[ \\omega \\left( t - \\frac{x}{c} \\right) \\right]",
              "E_0",
              "B_0"
            ]
          },
          {
            "text": "Швидкість поширення електромагнітних хвиль ___ , і у вакуумі (ε=μ=1) чисельно рівна ___",
            "formulas": [
              "c = \\frac{1}{\\sqrt{\\varepsilon \\varepsilon_0 \\mu \\mu_0}}",
              "c_0 = 2.99792458 \\times 10^8, \\text{м/с} \\approx 3 \\times 10^8, \\text{м/с}"
            ]
          },
          {
            "text": "Довжина електромагнітної хвилі ___",
            "formulas": [
              "\\lambda = \\frac{2\\pi c}{\\omega} = \\frac{c}{\\nu}"
            ]
          },
          {
            "text": "Густина енергії електромагнітної хвилі ___ . Густина енергії електричного поля ___ . Густина енергії магнітного поля ___ . У хвилі ___ , а ___ . Тут ___ - середнє значення поля у хвилі.",
            "formulas": [
              "w = \\varepsilon \\varepsilon_0 E_c^2",
              "w_E = \\frac{\\varepsilon \\varepsilon_0}{2} E^2",
              "w_B = \\frac{B^2}{2\\mu_0}",
              "w_E = w_B",
              "w = w_E + w_B",
              "Е_c"
            ]
          }
        ]
      },
      {
        "themeName": "Оптика.",
        "themeRoute": "optics",
        "info": [
          {
            "text": "Світло – електромагнітні хвилі, що сприймаються людським оком (довжина хвиль від 390 до 750 нанометрів). В геометричній оптиці не беруться до уваги хвильові властивості світла, а вважається, що в однорідному середовищі світло розповсюджується по прямій лінії (світловий промінь).",
            "formulas": []
          },
          {
            "text": "Швидкість світла залежить від середовища, в якому воно поширюється і має максимальне значення, яке рівне ___ , у вакуумі.",
            "formulas": [
              "3 \\times 10^{8} \\text{м/с}"
            ]
          },
          {
            "text": "Закон відбивання світла – кут падіння рівний куту відбивання.",
            "formulas": []
          },
          {
            "text": "Закон заломлення світла, яке проходить з середовища 1 в 2 ___ , де кути вимірюються між променем і нормаллю до поверхні розділу середовищ.",
            "formulas": [
              "n_1 \\sin \\theta_1 = n_2 \\sin \\theta_2"
            ]
          },
          {
            "text": "Абсолютний показник заломлення – відношення швидкості світла у вакуумі до швидкості світла в речовині 𝑛 = 𝑐 / 𝑣",
            "formulas": []
          },
          {
            "text": "Відносний показник заломлення пари речовин ___",
            "formulas": [
              "n_{2,1} = \\frac{v_1}{v_2} = \\frac{\\sin \\theta_1}{\\sin \\theta_2}"
            ]
          },
          {
            "text": "Повне відбивання при переході із оптично густішого середовища ___",
            "formulas": [
              "sin \\theta_{гр} = \\frac{n_2}{n_1}"
            ]
          },
          {
            "text": "Формула лінзи ___ , де f – фокусна відстань лінзи, u – відстань від предмета до лінзи, v – відстань від лінзи до зображення.",
            "formulas": [
              "\\frac{1}{f} = \\frac{1}{u} + \\frac{1}{v}"
            ]
          },
          {
            "text": "Формула тонкої лінзи ___ , де n – показник заломлення матеріалу лінзи, ___ – показник заломлення середовища, ___  – радіуси двох поверхонь лінзи.",
            "formulas": [
              "\\frac{n_0}{f} = (n - n_0) \\left[\\frac{1}{R_1} - \\frac{1}{R_2} \\right]",
              "n_0",
              "R_1"
            ]
          },
          {
            "text": "Оптичною силою лінзи називають величину, обернену до фокусної відстані лінзи 𝑑 = 1 / 𝑓, і одиницю вимірювання називають діоптрією (1д = м^-1 ).",
            "formulas": []
          },
          {
            "text": "Накладання когерентних хвиль ( хвиль із сталою різницею фаз в одній точці) дає сталу в часі інтерференційну картину - чергування світлих і темних полос. Когерентні пучки можна утворити біпризмою Френеля. Умова максимуму освітленості екрана – різниця ходу променів складає парне число півхвиль ___ , Умова мінімума освітленості екрана – різниця ходу складає непарне число півхвиль ___",
            "formulas": [
              "\\Delta l = \\frac{2k \\lambda}{2}",
              "\\Delta l = \\left( \\frac{2m + 1}{2} \\right) \\lambda"
            ]
          },
          {
            "text": "Дифракція – явище потрапляння світла в геометричну тінь. Різниця ходу променів під однаковим кутом φ для дифракційної гратки із сталою гатки d (d=a+b , де а – прозора частина гратки, b – непрозора частина гратки) ∆𝑙 = 𝑑 ∙ 𝑠𝑖𝑛𝜑, умова максимуму в дифракційній картині 𝑘𝜆 = 𝑑 ∙ 𝑠𝑖𝑛𝜑, 𝑘 = 0, 1, 2, … де k – відповідає порядку лінії інтерференційних смуг від центральної світлої лінії. Довжину хвилі з дифракційної картини можна визначити по формулі ___",
            "formulas": [
              "\\lambda = \\frac{d \\sin \\varphi}{k}"
            ]
          },
          {
            "text": "Дисперсія світла – явище залежності показника заломлення від довжини хвилі 𝑛 = 𝑓(𝜆)",
            "formulas": []
          },
          {
            "text": "Нагріті тверді тіла випромінюють неперервний (суцільний) спектр частот електромагнітних хвиль. При свіченні газів, або спалюванні простих речовин випромінюється лінійчатий спектр, що складається з окремих, не примикаючих один до одного монохроматичних електромагнітних променів.",
            "formulas": []
          },
          {
            "text": "Спектральний аналіз – методи визначення складу тіла, його температури та інших параметрів, засновані на вивченні спектру електромагнітного випромінювання тіла. Наприклад, інформація про хімічний склад зірок та їх температуру отримують по аналізу спектру частот електромагнітного випромінювання, що доходить до нас.",
            "formulas": []
          },
          {
            "text": "Звичайні джерела світла випромінюють «куски» (або «цуги» по-німецьки) електромагнітних хвиль, у яких площина коливання векторів електричного і магнітного полів різні в різних цугах. Але є певний клас прозорих речовин, які пропускають через себе тільки хвилі з коливанням електричного і магнітного полів в певній площині. Таке пропущене світло називають лінійно поляризованим, а саму речовину – поляризатором. Крім лінійної поляризації ще існую кругова поляризація – коли вектори електричного і магнітного полів при розповсюджені хвилі описують коло.",
            "formulas": []
          }
        ]
      }
    ]
  },
  {
    "id": 4,
    "sectionName": "Квантова фізика. Елементи теорії відносності.",
    "routeName": "quantum_physics",
    "img": "https://portaltele.com.ua/wp-content/uploads/2017/08/quant-net.jpg",
    "img_alt": "quantum_physics",
    "themes": [
      {
        "themeName": "Елементи теорії відносності.",
        "themeRoute": "elementsTheoryRelativity",
        "info": [
          {
            "text": "Принципи (постулати) теорії відносності Енштейна а) У всіх інерційних системах відліку всі фізичні явища протікають однаково; б) швидкість світла у вакуумі однакова у всіх інерціальних системах відліку. Події,що відбуваються в різних точках простору і є одночасними в одній системі відліку, не будуть одночасними в іншій",
            "formulas": []
          },
          {
            "text": "В даному підрозділі розглядаються дві системи відліку: нерухома система відліку (O;, x, y, z), в якій знаходимося ми (спостерігач) та, система відліку (O’; x’, y’, z’ ), яка рухається зі швидкістю V відносно нерухомої в напрямку x (напрями осей x i x’, y і y’, z і z’ співпадають).Перетворення Галілея: 𝑡′= 𝑡;\n 𝑥′ = 𝑥 − 𝑉𝑡;\n 𝑦′ = 𝑦;\n 𝑧′= 𝑧; \n Зворотні формули (перехід з системи О’до О) можна отримати заміною V → -V: 𝑡 = 𝑡′; 𝑥 = 𝑥′ + 𝑉𝑡′; 𝑦 = 𝑦′; 𝑧 = 𝑧′",
            "formulas": []
          },
          {
            "text": "Релятивістський закон додавання швидкостей.\n Класична механіка (принцип Галілея) ___ \n; Релятивістська механіка ___ ",
            "formulas": ["\\vec{u'} = \\vec{u} - \\vec{V}", "u_x' = \\frac{u_x - V}{1 - \\frac{u_x V}{c^2}}"]
          },
          {
            "text": "Перетворення проміжку часу (в системі О’ проміжок часу між послідовними подіями в одному і тому ж місці) ___ , або – в рухомій системі відліку проміжок часу скорочується (в системі покою проміжок Δt0) ___ ",
            "formulas": ["\\Delta t = \\frac{\\Delta t'}{\\sqrt{1 - \\frac{V^2}{c^2}}}", "\\Delta t_0 = \\Delta t \\sqrt{1 - \\frac{v^2}{c^2}}"]
          },
          {
            "text": "Перетворення довжини: довжина тіла зменшується в рухомій системі в порівнянні з довжиною цього тіла в нерухомій системі ___ ; ___",
            "formulas": ["l_0", "l = l_0 \\sqrt{1 - \\frac{V^2}{c^2}}"]
          },
          {
            "text": "Взаємозв’язок маси та енергії ___",
            "formulas": ["E = mc^2"]
          },
          {
            "text": "Енергія спокою частинки масою ___ - ___ , повна енергія частинки, яка рухається зі швидкістю V - ___ , кінетична енергія частинки - ___",
            "formulas": ["m_0", "E_0 = m_0c^2", "E = \\frac{m_0 c^2}{\\sqrt{1 - \\frac{v^2}{c^2}}}", "E_k = E − E_0"]
          }
        ]
      },
      {
        "themeName": "Світлові кванти. ",
        "themeRoute": "lightQuanta",
        "info": [
          {
            "text": "Тіло випромінює і поглинає енергію порціями – квантами 𝜀 = ℎ ∙ 𝜈, де h – стала Планка, ___ , ___ – частота випромінювання.",
            "formulas": ["h = 6.626176 \\times 10^{-34} \\text{Дж} \\cdot \\text{с}", "\\nu"]
          },
          {
            "text": "Фотоефект – явище вильоту електронів з тіла під дією електромагнітного випромінювання.",
            "formulas": []
          },
          {
            "text": "Закони фотоефекту: а) для кожної речовини залежно від її температури і стану поверхні існує мінімальна частота світла ___ , за якої ще можливий зовнішній фотоефект; б) кількість електронів, що вилітають із поверхні тіла під дією електромагнітного випромінювання, пропорційне його інтенсивності; в) максимальна кінетична енергія фотоелектронів залежить від частоти поглинутого випромінювання і не залежить від його інтенсивності.",
            "formulas": ["\\nu_0"]
          },
          {
            "text": "Рівняння Ейнштейна для зовнішнього фотоефекту: ___ , де ___ -робота виходу електрона із тіла, ___ – кінетична енергія електрона.",
            "formulas": ["h\\nu = A_0 + \\frac{m v^2}{2}", "A_0", "\\frac{m v^2}{2}"]
          },
          {
            "text": "Тиск світла при поглинанні ___ , де n – число фотонів, що падають на поверхню, h – стала Планка, ___ – частота падаючого світла, c – швидкість світла, І – інтенсивність випромінювання. Тиск світла при відбиванні в 2 рази більший ___",
            "formulas": ["p = \\frac{nh \\nu}{c} = \\frac{I}{c}", "\\nu", "p = \\frac{2nh \\nu}{c} = \\frac{2I}{c}"]
          }
        ]
      },
      {
        "themeName": "Атом та атомне ядро.",
        "themeRoute": "atomicNucleus",
        "info": [
          {
            "text": "",
            "formulas": []
          }
        ]
      }
    ]
  }
]