[
  {
    "id": 0,
    "sectionName": "Механіка",
    "themes": [
      {
        "themeName": "Основи кінематики.",
        "info": [
          {"text": "Механічний рух – це зміна положення тіла у просторі з часом.", "formulas": [] },
          {"text": "Під системою відліку розуміють сукупність тіла відліку, відносно якого фіксується зміна положення інших тіл, систему координат, яка позволяє числами виражати положення тіл і годинник для вимірювання часу. Обов’язковим елементом системи координат є одиниця довжини, яка дозволяє відраховувати відстані. В міжнародній системі СІ одиниця довжини – метр (1 м), а одиниця часу – секунда (1 с).", "formulas": [] },
          {"text": "Стан спокою і руху тіл є відносним і залежить від обраної системи відліку. (Людина в кріслі рухомого поїзду знаходиться в стані спокою відносно поїзду і рухається відносно Землі).", "formulas": []},
          {"text": "Матеріальна точка – це умовне тіло, яке не має розмірів і визначає положення реального тіла в просторі координатами цієї точки.", "formulas": [] },
          {"text": "Траєкторія руху тіла – уявна лінія, в кожній точці якої послідовно побувало тіло під час свого руху.", "formulas": [] },
          {"text": "Шлях – скалярна величина, рівна довжині кривої, що задає траєкторію руху тіла. Шлях вимірюють в метрах.", "formulas": [] },
          {"text": "Переміщення – векторна величина, що представляється напрямленим відрізком, який з’єднує початкову і кінцеву точки руху тіла. (Порівняйте – переміщення точки, що здійснила повний оберт по колу рівне нулю, а пройдений шлях 2πR, де R – радіус кола). Переміщення вимірюють в метрах.", "formulas": [] },
          {"text": "Швидкість тіла (величина векторна) визначає здійснене ним переміщення за одиницю часу: ___ , (розмірність м/c), де ___ – переміщення за проміжок часу ___.", "formulas": ["\\vec{v} = \\frac{\\Delta \\vec{r}}{\\Delta t}", "\\Delta \\vec{r} = \\vec{r}_2 - \\vec{r}_1", "\\Delta t = t_2 - t_1"] },
          {"text": "Додавання швидкостей ___ (швидкість людини відносно Землі складається із швидкості людини відносно поїзда і швидкості поїзда відносно Землі).", "formulas": ["\\vec{v}_{л|з} = \\vec{v}_{л|п} + \\vec{v}_{п|з}"] },
          {"text": "Нерівномірний рух – рух при якому тіло за рівні проміжки часу проходить різні відстані (шлях).", "formulas": [] },
          {"text": "Середня швидкість при нерівномірному русі – величина скалярна: 𝑣 = 𝑠/t , де s- шлях, який пройшло тіло за час t.", "formulas": [] },
          {"text": "Миттєва швидкість – величина векторна, дана для кожного моменту часу і визначається радіус-векторами положення тіла в моменти часу t і передуючий йому близький час t-Δt. ___", "formulas": ["\\begin{equation} \\vec{v}(t) = \\frac{\\vec{r}(t) - \\vec{r}(t - \\Delta t)}{\\Delta t} = \\frac{\\Delta \\vec{r}}{\\Delta t} \\end{equation}"] },
          {"text": "Рівномірний рух – рух при якому величина швидкості тіла незмінна (v(𝑡) = 𝑐𝑜𝑛𝑠𝑡).", "formulas": [] },
          {"text": "Прискорення (вектор): 𝑎⃗ = ∆ 𝑣⃗⃗/∆ 𝑡 ; розмірність - ___", "formulas": ["\\text{м}/\\text{с}^2"] },
          {"text": "Рівноприскорений рух – при якому напрям і величина прискорення руху незмінні (a(𝑡) = 𝑐𝑜𝑛𝑠𝑡).", "formulas": [] },
          {"text": "Рівняння рівномірного прямолінійного руху: ___", "formulas": ["\\begin{align} a_x(t) &= 0 \\\\ v_x(t) &= v_{0x} = const \\\\ x(t) &= x_0 + v_{0x} \\cdot t \\end{align}"] },
          {"text": "Рівняння рівноприскореного прямолінійного руху: ___", "formulas": ["\\begin{align} a_x(t) &= a_{0x} = const \\\\ v_x(t) &= v_{0x} + a_{0x} \\cdot t \\\\ x(t) &= x_0 + v_{0x}t + \\frac{a_{0x} \\cdot t^2}{2} \\end{align}"] },
          {"text": "Рівномірний рух по колу – обертання по колу радіусу R із сталою за величиною швидкістю. Руху по колу властива періодичність, яка характеризується періодом і частотою", "formulas": [] },
          {"text": "Період обертання – це час T, протягом якого тіло робить один повний оберт по колу (розмірність с).", "formulas": [] },
          {"text": "Частота обертання ν вказує кількість обертів тіла за одиницю часу (розмірність ___≡Гц). Період і частота зв’язані співвідношенням 𝜈 = 1/𝑇;", "formulas": ["c^{-1}\n"] },
          {"text": "Лінійна швидкість виражається відношенням довжини кола до періоду ___.", "formulas": ["v = \\frac{2\\pi R}{T}"] },
          {"text": "Кутова швидкість 𝜔 = ∆𝜑 / ∆𝑡 , де Δφ – кут, який замітає тіло за час Δt; розмірність кутової швидкості рад./𝑐 = ___.", "formulas": ["c^{-1}\n"] },
          {"text": "Зв'язок частоти і кутової швидкості 𝜔 = 2𝜋𝜈.", "formulas": [] },
          {"text": "Зв'язок лінійної і кутової швидкостей 𝑣 = 𝜔𝑅, де R- радіус кола, по якому рухається тіло.", "formulas": [] },
          {"text": "Рівняння рівномірного руху по колу 𝜑(𝑡) = 𝜔𝑡.", "formulas": [] },
          {"text": "При рівномірному русі по колу величина лінійної швидкості не міняється, але міняється напрям швидкості. Це викликає прискорення, яке називають доцентровим прискоренням ___. Доцентрове прискорення векторна величина (має напрям від тіла до центру кола).", "formulas": ["a = \\frac{v^2}{R} = \\omega^2 \\cdot R"] }
        ]
      },
      {
        "themeName": "Основи динаміки.",
        "info": [
          {"text": "Перший закон Ньютона – якщо на тіло не діють сили, або сума прикладених сил рівна нулеві, то таке тіло знаходиться в стані спокою, або прямолінійного рівномірного руху ___.", "formulas": ["\\sum_{i} \\vec{F}_i = 0 \\implies \\vec{v} = \\text{const}"] },
          {"text": "Інерційні системи відліку – системи відліку, які знаходяться в стані спокою, або рівномірного прямолінійного руху одна відносно одної.", "formulas": [] },
          {"text": "Принцип відносності Галілея – всі фізичні процеси в інерційних системах протікають однаково. Час є абсолютним – одним і тим же у всіх системах відліку.", "formulas": [] },
          {"text": "Сила – векторна фізична величина, що характеризує ступінь взаємодії тіл.", "formulas": [] },
          {"text": "Другий закон Ньютона – якщо на тіло діє сила, то воно рухається з прискоренням направленим по напряму сили і величиною пропорційною величині прикладеної сили ___ , де m - маса тіла. Інші форми запису закону ___, ___, де ___ – імпульс тіла. В цьому законі маса тіла виступає в ролі міри інерції тіла. В системі СІ одиниця маси - кілограм (1 кг). Одиниця вимірювання сили визначається одиницями довжини, часу і маси ___ і називається ньютон (1 Н).", "formulas": ["\\vec{a} = \\frac{\\vec{F}}{m}", "\\vec{F} = m\\vec{a}", "\\vec{F} = \\frac{m \\Delta \\vec{v}}{\\Delta t} = \\frac{\\Delta \\vec{p}}{\\Delta t}", "\\vec{p} = m \\vec{v}", "\\frac{\\text{kg} \\cdot \\text{m}}{c^2}"] },
          {"text": "Якщо на тіло діє декілька сил, то результуюча сила знаходиться за правилом додавання векторів.", "formulas": [] },
          {"text": "Третій закон Ньютона – сили, з якими взаємодіють два тіла, одинакові за величиною і протилежні за напрямком ___. (Зверніть увагу, що дані сили прикладені до різних тіл)", "formulas": ["\\vec{F}_{12} = -\\vec{F}_{21}"] },
          {"text": "Гравітаційна сила притягання властива тілам, які мають масу.", "formulas": [] },
          {"text": "Закон всесвітнього тяжіння (четвертий закон Ньютона) – два тіла з масою притягуються між собою з силою, пропорційною масам тіл і обернено пропорційною квадрату відстані між ними ___ , де коефіцієнт пропорційності ___ , який називається гравітаційною сталою. Тут маса тіла виступає у ролі джерела гравітаційної взаємодії.", "formulas": ["F = G \\frac{m_1 m_2}{R^2}", "G = 6.6720 \\cdot 10^{-11} \\text{ Н} \\cdot (\\text{м}^2/\\text{кг}^2)"] },
          {"text": "Сила тяжіння – гравітаційна сила, з якою Земля притягує до себе тіла ___, де m – маса тіла, g – прискорення вільного падіння направлене до центру Землі, числове значення якого залежить від маси і радіусу Землі, географічної широти місцевості і висоти над земною поверхнею ___.", "formulas": ["F_т = mg", "g = G \\frac{M_з}{(R_з + h)^2}"] },
          {"text": "Якщо на тіло діє тільки сила тяжіння, то тіло здійснює вільне падіння. Вид траєкторії тіла залежить від напрямку і величини початкової швидкості. Коли початкова швидкість рівна нулю або паралельна силі тяжіння, діло здійснює прямолінійний рух по вертикалі. Якщо початкова швидкість напрямлена під кутом до сили тяжіння, то тіло здійснює вільне падіння по вертикалі з початковою вертикальною складовою швидкості та рівномірний рух по горизонталі з початковою горизонтальною складовою швидкості. Результуюча траєкторія має вид параболи.", "formulas": [] },
          {"text": "Вага тіла – сила з якою тіло діє на підставку чи підвіс внаслідок тяжіння. Якщо тіло нерухоме, або рухається рівномірно і прямолінійно, то вага тіла ___ , якщо тіло рухається з прискоренням ___, то вага тіла ___. Тут ___ – проекція вектора прискорення на вертикальну вісь направлену до центру Землі.", "formulas": ["P = F_т = mg", "a_z", "P = m(g - a_z)", "a_z"]},
          {"text": "Невагомість виникає у разі вільного падіння (з прискоренням ___), в результаті чого тіло діє з нульовою силою на підставку або підвіс.", "formulas": ["a_z = g"]},
          {"text": "Штучний супутник – об’єкт поміщений на орбіту Землі або іншого небесного тіла зусиллями людини. Рух супутника по орбіті обумовлений гравітаційною силою.", "formulas": []},
          {"text": "Перша космічна швидкість – швидкість, яку, нехтуючи опором повітря, необхідно надати тілу, щоб воно рухалось по круговій орбіті з радіусом рівним радіусу Землі -  ___ , (для Землі ___, ___) і чисельно рівна ___.", "formulas": ["v_1 = \\sqrt{G \\frac{M_з}{R_з}} = \\sqrt{g \\cdot R_з}", "М_з=5,97\\cdot10^{24} \\text{кг}", "R_з=6 378 000 м", "v_1 = 7,9 \\text{км/с}"]},
          {"text": "Сила пружності – сила, що виникає при деформації твердого тіла, яка намагається відновити початкову форму тіла.", "formulas": [] },
          {"text": "Закон Гука – деформація в пружних тілах (видовження або стиснення) прямо пропорційна силі, яка визиває дану деформацію ___ , де k – коефіцієнт жорсткості тіла (розмірність Н/м ), Δx – величина деформації.", "formulas": ["\\vec{F} = -k \\Delta x\n"] },
          {"text": "Сила тертя виникає під час руху одного тіла по поверхні іншого і направлена вздовж поверхні дотику тіл проти відносної швидкості їхнього руху. Сила тертя залежить від: відносної швидкості руху тіл; речовини, з якої складаються тіла; стану поверхонь (твердих) тіл; розмірів і форми тіла (при русі в газі або рідині); ваги тіла.", "formulas": [] },
          {"text": "Сила тертя ковзання направлена проти напряму руху тіла і прямо пропорційна силі реакції опори ___ , де безрозмірний коефіцієнт тертя μ залежить від природи та якості поверхонь, що дотикаються, N – нормальна складова реакції опори.", "formulas": ["F_{тр} = \\mu \\cdot N"] },
          {"text": "Сила тертя спокою | 𝐹 | ≤ 𝜇 ∙ 𝑁 . Сила тертя спокою перешкоджає початкові руху тіла.", "formulas": [] },
          {"text": "Сила тертя кочення прямо пропорційна реакції опори N і обернено пропорційна радіусу тіла кочення R; ___ , де f – коефіцієнт тертя кочення (розмірність – м)", "formulas": ["F = \\frac{f}{R} \\cdot N"] },
          {"text": "Момент сили – векторна величина, рівна добутку сили на величину плеча прикладання сили відносно осі або точки обертання. Напрям моменту сили направлений перпендикулярно до площини, яку утворюють вектор сили і радіус-вектор точки прикладання сили ___ . Розмірність моменту сили ___ .", "formulas": ["\\vec{M} = [\\vec{r} \\times \\vec{F}]", "м \\cdot Н = \\text{кг} \\cdot \\text{м}^2 / \\text{с}^2"] },
          {"text": "Умови рівноваги тіл: для рівноваги тіл необхідне виконання двох умов: 1) векторна сума прикладених до тіл сил повинна дорівнювати нулю ___ ; 2) векторна сума моментів прикладених до тіла сил (відносно осі або точки) повинна дорівнювати нулю ___ ;", "formulas": ["\\vec{F}_1 + \\vec{F}_2 + \\vec{F}_3 + \\cdots = \\sum \\vec{F}_i = 0", "\\vec{M}_1 + \\vec{M}_2 + \\vec{M}_3 + \\cdots = \\sum \\vec{M}_i = 0"] },
          {"text": "Рівновага – стан тіла, за якого в розглядуваній системі відліку відсутнє переміщення будь-якої його точки під дією прикладених до нього сил. Рівновага буває стійкою, нестійкою і байдужою", "formulas": [] }
        ]
      },
      {
        "themeName": "Елементи механіки рідин та газів.",
        "info": [
          {"text": "", "formulas": [] }
        ]
      },
      {
        "themeName": "Закони збереження в механіці. ",
        "info": [
          {"text": "", "formulas": [] }
        ]
      },
      {
        "themeName": "Механічні коливання і хвилі. ",
        "info": [
          {"text": "", "formulas": [] }
        ]
      }
    ]
  },
  {
    "id":  1,
    "sectionName": "Молекулярна фізика і термодинаміка",
    "themes": [
      {
        "themeName": "Основи молекулярно- кінетичної теорії. ",
        "info": [
          {"text": "", "formulas": [] }
        ]
      },
      {
        "themeName": "Основи термодинаміки.",
        "info": [
          {"text": "", "formulas": [] }
        ]
      },
      {
        "themeName": "Властивості газів, рідин і твердих тіл.",
        "info": [
          {"text": "", "formulas": [] }
        ]
      }
    ]
  },
  {
    "id":  2,
    "sectionName": "Електродинаміка",
    "themes": [
      {
        "themeName": "Основи електростатики.",
        "info": [
          {"text": "", "formulas": [] }
        ]
      },
      {
        "themeName": "Закони постійного струму.",
        "info": [
          {"text": "", "formulas": [] }
        ]
      },
      {
        "themeName": "Електричний струм у різних середовищах.",
        "info": [
          {"text": "", "formulas": [] }
        ]
      },
      {
        "themeName": "Магнітне поле, електромагнітна індукція. Взаємодія",
        "info": [
          {"text": "", "formulas": [] }
        ]
      }
    ]
  },
  {
    "id":  3,
    "sectionName": "Електромагнітні коливання і хвилі. Оптика",
    "themes": [
      {
        "themeName": "Електромагнітні коливання і хвилі.",
        "info": [
          {"text": "", "formulas": [] }
        ]
      },
      {
        "themeName": "Оптика.",
        "info": [
          {"text": "", "formulas": [] }
        ]
      }
    ]
  },
  {
    "id":  4,
    "sectionName": "Квантова фізика. Елементи теорії відносності.",
    "themes": [
      {
        "themeName": "Елементи теорії відносності.",
        "info": [
          {"text": "", "formulas": [] }
        ]
      },
      {
        "themeName": "Світлові кванти. ",
        "info": [
          {"text": "", "formulas": [] }
        ]
      },
      {
        "themeName": "Атом та атомне ядро.",
        "info": [
          {"text": "", "formulas": [] }
        ]
      },
      {
        "themeName": "Магнітне поле, електромагнітна індукція. Взаємодія",
        "info": [
          {"text": "", "formulas": [] }
        ]
      }
    ]
  }
]